<?php

use Illuminate\Database\Seeder;

class TipSeeder extends Seeder
{
    protected $tips = [
        [ 'title' => 'व्यायामाच्या कंटाळ्याला करा बाय बाय!', 'image' => 'http://firstaid.sapeksh.com/AppImages/Chrysanthemum.jpg', 'eflag' => false, 'mflag' => true, 'is_active' => true, 'description' => 'चौरस आहार आणि नित्याचा व्यायाम ही उत्तम आरोग्याची गुरुकिल्ली आहे. मग तो कोणत्याही कारणासाठी असो. अगदी फिट राहण्यापासून तणाव नियोजन, सुडौल बांधा किंवा वजन कमी करण्यापर्यंत.\r\n\r\nचौरस आहार आणि नित्याचा व्यायाम ही उत्तम आरोग्याची गुरुकिल्ली आहे. मग तो कोणत्याही कारणासाठी असो. अगदी फिट राहण्यापासून तणाव नियोजन, सुडौल बांधा किंवा वजन कमी करण्यापर्यंत. तुम्हाला तुमच्या व्यक्तिमत्त्व आणि जीवनशैलीला साजेसा व्यायामप्रकार निवडणं तर आवश्यक आहेच. पण त्यात आवड आणि सातत्य राखणंही तितकंच महत्त्वाचं आहे.' ],
        [ 'title' => 'प्रेरणा द्या', 'image' => 'http://firstaid.sapeksh.com/AppImages/Tulips.jpg', 'eflag' => false, 'mflag' => true, 'is_active' => true, 'description' => 'मुलांना गोड नाही पण थोडे कलरफूल असलेले पदार्थ खायला द्या. त्यामुळे गोड पदार्थांकडून त्यांचे लक्ष दुसरीकडे वळेल. यामध्ये फळे, घरच्या घरी केलेले काही आकर्षक दिसतील असे पदार्थ यांचा समावेश करु शकता. यामध्ये थोडे वेगळे रंग असल्यास मुले या पदार्थांकडे आकर्षित होतील आणि नकळत गोड खाण्याकडे त्यांचे दुर्लक्ष होईल' ],
        [ 'title' => 'वेगवेगळे पर्याय द्या', 'image' => 'http://firstaid.sapeksh.com/AppImages/Hydrangeas.jpg', 'eflag' => false, 'mflag' => true, 'is_active' => true, 'description' => 'मुलांना सतत पोळीभाजी किंवा भात खाणे याचा कंटाळा येऊ शकतो. अशावेळी मुले जाम, तूप-साखर पोळीसोबत खाण्यासाठी मागतात. मात्र पोळीऐवजी पराठा, फ्रँकी असे काही केल्यास मुले ते पदार्थ आवडीने खातात. त्यामुळे रोजच्या जेवणाला पर्याय उपलब्ध ठेवल्यास मुले योग्य पद्धतीने जेवण करतात आणि त्यांना पोषक आहार मिळण्यास मदत होते.' ],
    ];
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->tips as $tip) {
            DB::table('tips')->insert($tip);
        }
    }
}
